---
title: Tile
classe: Autodesk.Revit.DB.Visual.Tile
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 29
---

# Tile

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String TextureLinkTextureTransforms { get; }` | `Tile.TextureLinkTextureTransforms` | String |
| `String TextureOffsetLock { get; }` | `Tile.TextureOffsetLock` | String |
| `String TextureRealWorldOffsetX { get; }` | `Tile.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Tile.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldScaleX { get; }` | `Tile.TextureRealWorldScaleX` | String |
| `String TextureRealWorldScaleY { get; }` | `Tile.TextureRealWorldScaleY` | String |
| `String TextureScaleLock { get; }` | `Tile.TextureScaleLock` | String |
| `String TextureURepeat { get; }` | `Tile.TextureURepeat` | String |
| `String TextureVRepeat { get; }` | `Tile.TextureVRepeat` | String |
| `String TextureWAngle { get; }` | `Tile.TextureWAngle` | String |
| `String TileBrickColor { get; }` | `Tile.TileBrickColor` | String |
| `String TileBrickType { get; }` | `Tile.TileBrickType` | String |
| `String TileChangeColumn { get; }` | `Tile.TileChangeColumn` | String |
| `String TileChangeRow { get; }` | `Tile.TileChangeRow` | String |
| `String TileColorVariance { get; }` | `Tile.TileColorVariance` | String |
| `String TileEdgeRoughness { get; }` | `Tile.TileEdgeRoughness` | String |
| `String TileFadeVariance { get; }` | `Tile.TileFadeVariance` | String |
| `String TileHorizontalCount { get; }` | `Tile.TileHorizontalCount` | String |
| `String TileHorizontalGap { get; }` | `Tile.TileHorizontalGap` | String |
| `String TileLineShift { get; }` | `Tile.TileLineShift` | String |
| `String TileMortarColor { get; }` | `Tile.TileMortarColor` | String |
| `String TilePerColumn { get; }` | `Tile.TilePerColumn` | String |
| `String TilePerRow { get; }` | `Tile.TilePerRow` | String |
| `String TileRandomSeed { get; }` | `Tile.TileRandomSeed` | String |
| `String TileRandomShift { get; }` | `Tile.TileRandomShift` | String |
| `String TileUseColumnEdit { get; }` | `Tile.TileUseColumnEdit` | String |
| `String TileUseRowEdit { get; }` | `Tile.TileUseRowEdit` | String |
| `String TileVerticalCount { get; }` | `Tile.TileVerticalCount` | String |
| `String TileVerticalGap { get; }` | `Tile.TileVerticalGap` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```